unit DDDaddress;

interface

uses
  Windows, Messages, SysUtils, Variants, Classes, Graphics, Controls, Forms,
  Dialogs, StdCtrls;

type
  TForm1 = class(TForm)
    doList: TListBox;
    gunList: TListBox;
    Label1: TLabel;
    Label2: TLabel;
    Label3: TLabel;
    resultStr: TLabel;
    procedure doListClick(Sender: TObject);
    procedure gunListClick(Sender: TObject);
  private
    { Private declarations }
  public
    { Public declarations }
  end;

var
  Form1: TForm1;
type
  TDDDNum=record
    j:String[10]; // 군의 이름
    p:Integer;
    end;
const
  DDDNum:array [0..8,0..47] of TDDDNum=(
    {강원}
   ((j:'강릉';p:0391),(j:'고성';p:0392),(j:'근덕';p:0397),(j:'대화';p:0374),
   (j:'도계';p:0395),(j:'동송';p:0353),(j:'동해';p:0394),(j:'명주';p:0391),
   (j:'북평';p:0394),(j:'삼척';p:0397),(j:'상동';p:0373),(j:'설악';p:0392),
   (j:'속초';p:0392),(j:'양구';p:0364),(j:'양양';p:0396),(j:'영월';p:0373),
   (j:'원주';p:0371),(j:'인제';p:0365),(j:'정선';p:0398),(j:'주문진';p:0391),
   (j:'철원';p:0353),(j:'춘성';p:0361),(j:'춘천';p:0361),(j:'태백';p:0395),
   (j:'평창';p:0374),(j:'홍천';p:0366),(j:'화광';p:0395),(j:'화천';p:0363),
   (j:'횡계';p:0373),(j:'횡성';p:0372),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0)),

   {경기}
   ((j:'가평';p:0356),(j:'강화';p:0349),(j:'고양';p:0344),(j:'과천';p:02),
   (j:'광명';p:02),(j:'광주';p:0347),(j:'구리';p:0346),(j:'군포';p:0343),
   (j:'김포';p:0341),(j:'남양';p:0339),(j:'남양주';p:0346),(j:'동두천';p:0351),
   (j:'문산';p:0348),(j:'미금';p:0346),(j:'발안';p:0339),(j:'부천';p:032),
   (j:'송탄';p:0333),(j:'수원';p:0331),(j:'시흥';p:0345),(j:'성남';p:0342),
   (j:'안산';p:0345),(j:'안성';p:0334),(j:'안양';p:0343),(j:'안중';p:0333),
   (j:'양주';p:0351),(j:'양평';p:0338),(j:'여주';p:0337),(j:'연천';p:0355),
   (j:'오산';p:0339),(j:'옹진';p:032),(j:'용문';p:0338),(j:'용인';p:0335),
   (j:'원당';p:0344),(j:'의왕';p:0343),(j:'의정부';p:0351),(j:'이천';p:0336),
   (j:'일산';p:0344),(j:'장호원';p:0336),(j:'전곡';p:0355),(j:'청평';p:0356),
   (j:'통진';p:0341),(j:'평택';p:0333),(j:'파주';p:0348),(j:'포천';p:0357),
   (j:'하남';p:0347),(j:'화성';p:0339),(j:'서울';p:02),(j:'인천';p:032)),

   {경남}
   ((j:'거제';p:0558),(j:'거창';p:0598),(j:'고성';p:0556),(j:'고현';p:0558),
   (j:'김해';p:0525),(j:'남지';p:0559),(j:'남해';p:0594),(j:'마산';p:0551),
   (j:'밀양';p:0527),(j:'사천';p:0593),(j:'산청';p:0596),(j:'삼랑진';p:0527),
   (j:'삼천포';p:0593),(j:'수산';p:0527),(j:'양산';p:0523),(j:'온산';p:0522),
   (j:'울산';p:0522),(j:'울주';p:0522),(j:'의령';p:0555),(j:'의창';p:0551),
   (j:'장승포';p:0558),(j:'지족';p:0594),(j:'진양';p:0591),(j:'진영';p:0525),
   (j:'진주';p:0591),(j:'진해';p:0553),(j:'창녕';p:0559),(j:'충무';p:0557),
   (j:'통영';p:0557),(j:'하동';p:0595),(j:'함안';p:0552),(j:'함양';p:0597),
   (j:'합천';p:0599),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0)),

{경북}
   ((j:'가평';p:0356),(j:'강화';p:0349),(j:'고양';p:0344),(j:'과천';p:02),
   (j:'광명';p:02),(j:'광주';p:0347),(j:'구리';p:0346),(j:'군포';p:0343),
   (j:'김포';p:0341),(j:'남양';p:0339),(j:'남양주';p:0346),(j:'동두천';p:0351),
   (j:'문산';p:0348),(j:'미금';p:0346),(j:'발안';p:0339),(j:'부천';p:032),
   (j:'송탄';p:0333),(j:'수원';p:0331),(j:'시흥';p:0345),(j:'성남';p:0342),
   (j:'안산';p:0345),(j:'안성';p:0334),(j:'안양';p:0343),(j:'안중';p:0333),
   (j:'양주';p:0351),(j:'양평';p:0338),(j:'여주';p:0337),(j:'연천';p:0355),
   (j:'오산';p:0339),(j:'옹진';p:032),(j:'용문';p:0338),(j:'용인';p:0335),
   (j:'원당';p:0344),(j:'의왕';p:0343),(j:'의정부';p:0351),(j:'이천';p:0336),
   (j:'일산';p:0344),(j:'장호원';p:0336),(j:'전곡';p:0355),(j:'청평';p:0356),
   (j:'통진';p:0341),(j:'평택';p:0333),(j:'파주';p:0348),(j:'포천';p:0357),
   (j:'하남';p:0347),(j:'화성';p:0339),(j:'서울';p:02),(j:'인천';p:032)),

{전남}
   ((j:'가평';p:0356),(j:'강화';p:0349),(j:'고양';p:0344),(j:'과천';p:02),
   (j:'광명';p:02),(j:'광주';p:0347),(j:'구리';p:0346),(j:'군포';p:0343),
   (j:'김포';p:0341),(j:'남양';p:0339),(j:'남양주';p:0346),(j:'동두천';p:0351),
   (j:'문산';p:0348),(j:'미금';p:0346),(j:'발안';p:0339),(j:'부천';p:032),
   (j:'송탄';p:0333),(j:'수원';p:0331),(j:'시흥';p:0345),(j:'성남';p:0342),
   (j:'안산';p:0345),(j:'안성';p:0334),(j:'안양';p:0343),(j:'안중';p:0333),
   (j:'양주';p:0351),(j:'양평';p:0338),(j:'여주';p:0337),(j:'연천';p:0355),
   (j:'오산';p:0339),(j:'옹진';p:032),(j:'용문';p:0338),(j:'용인';p:0335),
   (j:'원당';p:0344),(j:'의왕';p:0343),(j:'의정부';p:0351),(j:'이천';p:0336),
   (j:'일산';p:0344),(j:'장호원';p:0336),(j:'전곡';p:0355),(j:'청평';p:0356),
   (j:'통진';p:0341),(j:'평택';p:0333),(j:'파주';p:0348),(j:'포천';p:0357),
   (j:'하남';p:0347),(j:'화성';p:0339),(j:'서울';p:02),(j:'인천';p:032)),
{전북}
   ((j:'가평';p:0356),(j:'강화';p:0349),(j:'고양';p:0344),(j:'과천';p:02),
   (j:'광명';p:02),(j:'광주';p:0347),(j:'구리';p:0346),(j:'군포';p:0343),
   (j:'김포';p:0341),(j:'남양';p:0339),(j:'남양주';p:0346),(j:'동두천';p:0351),
   (j:'문산';p:0348),(j:'미금';p:0346),(j:'발안';p:0339),(j:'부천';p:032),
   (j:'송탄';p:0333),(j:'수원';p:0331),(j:'시흥';p:0345),(j:'성남';p:0342),
   (j:'안산';p:0345),(j:'안성';p:0334),(j:'안양';p:0343),(j:'안중';p:0333),
   (j:'양주';p:0351),(j:'양평';p:0338),(j:'여주';p:0337),(j:'연천';p:0355),
   (j:'오산';p:0339),(j:'옹진';p:032),(j:'용문';p:0338),(j:'용인';p:0335),
   (j:'원당';p:0344),(j:'의왕';p:0343),(j:'의정부';p:0351),(j:'이천';p:0336),
   (j:'일산';p:0344),(j:'장호원';p:0336),(j:'전곡';p:0355),(j:'청평';p:0356),
   (j:'통진';p:0341),(j:'평택';p:0333),(j:'파주';p:0348),(j:'포천';p:0357),
   (j:'하남';p:0347),(j:'화성';p:0339),(j:'서울';p:02),(j:'인천';p:032)),
{제주}
   ((j:'전지역';p:064),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0),
   (j:'';p:0),(j:'';p:0),(j:'';p:0),(j:'';p:0)),
{충남}
   ((j:'가평';p:0356),(j:'강화';p:0349),(j:'고양';p:0344),(j:'과천';p:02),
   (j:'광명';p:02),(j:'광주';p:0347),(j:'구리';p:0346),(j:'군포';p:0343),
   (j:'김포';p:0341),(j:'남양';p:0339),(j:'남양주';p:0346),(j:'동두천';p:0351),
   (j:'문산';p:0348),(j:'미금';p:0346),(j:'발안';p:0339),(j:'부천';p:032),
   (j:'송탄';p:0333),(j:'수원';p:0331),(j:'시흥';p:0345),(j:'성남';p:0342),
   (j:'안산';p:0345),(j:'안성';p:0334),(j:'안양';p:0343),(j:'안중';p:0333),
   (j:'양주';p:0351),(j:'양평';p:0338),(j:'여주';p:0337),(j:'연천';p:0355),
   (j:'오산';p:0339),(j:'옹진';p:032),(j:'용문';p:0338),(j:'용인';p:0335),
   (j:'원당';p:0344),(j:'의왕';p:0343),(j:'의정부';p:0351),(j:'이천';p:0336),
   (j:'일산';p:0344),(j:'장호원';p:0336),(j:'전곡';p:0355),(j:'청평';p:0356),
   (j:'통진';p:0341),(j:'평택';p:0333),(j:'파주';p:0348),(j:'포천';p:0357),
   (j:'하남';p:0347),(j:'화성';p:0339),(j:'서울';p:02),(j:'인천';p:032)),
{층븍}
   ((j:'가평';p:0356),(j:'강화';p:0349),(j:'고양';p:0344),(j:'과천';p:02),
   (j:'광명';p:02),(j:'광주';p:0347),(j:'구리';p:0346),(j:'군포';p:0343),
   (j:'김포';p:0341),(j:'남양';p:0339),(j:'남양주';p:0346),(j:'동두천';p:0351),
   (j:'문산';p:0348),(j:'미금';p:0346),(j:'발안';p:0339),(j:'부천';p:032),
   (j:'송탄';p:0333),(j:'수원';p:0331),(j:'시흥';p:0345),(j:'성남';p:0342),
   (j:'안산';p:0345),(j:'안성';p:0334),(j:'안양';p:0343),(j:'안중';p:0333),
   (j:'양주';p:0351),(j:'양평';p:0338),(j:'여주';p:0337),(j:'연천';p:0355),
   (j:'오산';p:0339),(j:'옹진';p:032),(j:'용문';p:0338),(j:'용인';p:0335),
   (j:'원당';p:0344),(j:'의왕';p:0343),(j:'의정부';p:0351),(j:'이천';p:0336),
   (j:'일산';p:0344),(j:'장호원';p:0336),(j:'전곡';p:0355),(j:'청평';p:0356),
   (j:'통진';p:0341),(j:'평택';p:0333),(j:'파주';p:0348),(j:'포천';p:0357),
   (j:'하남';p:0347),(j:'화성';p:0339),(j:'서울';p:02),(j:'인천';p:032))
    );
implementation

{$R *.dfm}

procedure TForm1.doListClick(Sender: TObject);
var
  idx,i:Integer;
begin
  idx:=doList.ItemIndex;
  gunList.Items.Clear;

  for i:=0 to 47 do
    if DDDNum[idx,i].j <> '' then
      gunList.Items.Add(DDDNum[idx,i].j);

end;

procedure TForm1.gunListClick(Sender: TObject);
begin
  resultStr.Caption := '0' + IntToStr(DDDNum[doList.ItemIndex, gunList.ItemIndex].p);
end;

end.
